Tekla Open API Reference for Tekla Structures 2025
PolyBeam.GetCenterLinePolycurve Method
 Get centerline as polycurve
 Namespace: Tekla.Structures.Model
 Assembly: Tekla.Structures.Model (in Tekla.Structures.Model.dll) Version: 2025.0.0-alpha00048669+a99462f17964bc42624ada6e8d316db2d795d226
Syntax
public Polycurve GetCenterLinePolycurve()
Public Function GetCenterLinePolycurve As Polycurve
Return Value
Type: Polycurve
Polycurve instance or null
See Also
Reference
PolyBeam Class
Tekla.Structures.Model Namespace